app/controllers/take_tests_controller.rb

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @section = Section.find(params[:id])
    session[:section] = @section.id
    @test    = Test.find(@section.test_id)

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 13]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
UPDATE "users" SET "pssed_sections" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["pssed_sections", "---\n- 2\n"], ["updated_at", "2015-08-13 19:39:17.426731"], ["id", 1]]
---
  def check
    @user = current_user
    @section = session[:section]
    @test_id = session[:test_id]
    @wrong_answers = []
    params.delete :utf8
    params.delete :authenticity_token
    params.delete :commit
    params.delete :controller
    params.delete :action
    params.each do |question, answer|
      solution = Answer.find(answer)
      if solution.correct == false
        @wrong_answer = solution.id
      end
    end
    if @wrong_answer == nil
      flash[:info] = "all correct"
      user = User.find(@user.id)
      @test_array =*1..@test_id
      user.update_attribute :pssed_sections, @test_array